# Brewfile for dotfiles setup

# CLI Tools
brew "git"
brew "stow"
brew "zsh"
brew "ripgrep"
brew "pyenv"
brew "xz"

# Applications
cask "intellij-idea"
cask "raycast"
cask "slack"
cask "spotify"
cask "viber"
cask "whatsapp"
cask "bitwarden"
cask "docker"
cask "postman"
cask "simplenote"
cask "telegram"
