# Brewfile for dotfiles setup

# CLI Tools
brew "git"
brew "stow"
brew "zsh"
brew "ripgrep"
brew "pyenv"
brew "xz"
brew "starship"
brew "node"
brew "yarn"
brew "gnupg"
brew "pinentry-mac"
brew "zoxide"  # Smarter cd command

# Applications
cask "intellij-idea"
cask "raycast"
cask "slack"
cask "spotify"
cask "viber"
cask "whatsapp"
cask "bitwarden"
cask "docker"
cask "postman"
cask "telegram"
cask "simplenote"
cask "snipaste"
cask "logi-options+"
cask "google-chrome"
cask "omnidisksweeper"
cask "microsoft-teams"
cask "grammarly-desktop"
cask "openvpn-connect"
cask "openlens"
cask "visual-studio-code"
cask "cursor"
cask "tailscale"
cask "veracrypt"
cask "little-snitch"
cask "disk-arbitrator"
cask "qflipper"
cask "discord"
cask "steam"
# Note: Mac App Store apps require manual installation:
# - TestFlight (App Store ID: 899247664)
# - Eufy Security 
# - PiPifier (App Store ID: 1160374471)
# Note: Deco may not be available via Homebrew
# Note: klogg may need manual installation or different source